comp-sci/emacs.org
#+TITLE: Emacs
#+AUTHOR: Alex Nelson
#+EMAIL: pqnelson@gmail.com
#+DATE: <2022-12-18T09:36:29-08:00>
#+LANGUAGE: en
#+OPTIONS: H:5
#+HTML_DOCTYPE: html5
#+INCLUDE: ../org-macros.org
#+HTML_LINK_UP: ./index.html
#+HTML_LINK_HOME: ../index.html
#+HTML_HEAD_EXTRA: <link rel="stylesheet" type="text/css" href="../css/stylesheet.css" />
# Created Sunday December 18, 2022 at  9:36AM

* Building Emacs
:PROPERTIES:
:CUSTOM_ID: h-8891785c-1a46-46ab-8276-4889fce0c0de
:END:

Compiling Emacs from scratch does not seem to be well documented.

** On Windows
:PROPERTIES:
:CUSTOM_ID: h-ba49b372-73c2-4fd0-b06a-82b7e417c232
:END:

There are two ways to go about this: either use Mingw, or use the
Windows Subystem for Linux (WSL).

MinGW uses Pacman as its package manager, so all you need to do is
something like ~pacman -S emacs~.

For WSL, I use Ubuntu WSL. Although I could just use the package
provided, I build it from scratch. My shell looks something like:

#+begin_example
~ $ mkdir -p src/
~ $ cd src
~/src/ $ git clone https://git.savannah.gnu.org/git/emacs.git
~/src/emacs/ $ git checkout emacs-28
~/src/emacs/ $ ./autogen.sh
~/src/emacs/ $ ./configure --with-wide-int --with-gnutls=ifavailable --with-x-toolkit=no --with-m17n-flt --with-modules --with-json --with-threads --with-included-regex --with-compress-install CFLAGS="-O3 -mtune=native -march=native -fno-finite-math-only"
...
~/src/emacs/ $ make
...
~/src/emacs/ $ sudo make install
...
#+end_example

* Architecture
:PROPERTIES:
:CUSTOM_ID: h-4ca3ccca-26c9-4547-b901-c17e58cd988d
:END:

- Richard Stallman's [[https://www.gnu.org/software/emacs/emacs-paper.html][1981 Emacs Paper]]
- [[https://chrismennie.ca/EMACS-Conceptual-Architecture.pdf][Conceptual Views of EMACS’s Architecture (PDF)]]
- [[https://www.finseth.com/craft/][Craft of Text Editing]]
- Greenberg's [[https://multicians.org/mepap.html][Multics Emacs: The History, Design and Implementation]]
- [[https://corwin.bru.st/2024-01-09-emacs-devel-design-and-architecture/][Emacs Devel: Design and Architecture]]
- https://lists.gnu.org/archive/html/emacs-devel/2010-07/msg00315.html
- https://github.com/DavidSatimeWallin/openemacs

** Text Editor Architecture
:PROPERTIES:
:CUSTOM_ID: h-62586872-e676-4902-ae7a-5f2f27ac03d1
:END:

More generally, we could examine the architecture of a "generic" text
editor.

- Finseth's dissertation "Theory and practice of text editors, or, A cookbook for an Emacs" https://dspace.mit.edu/handle/1721.1/15905
- https://viewsourcecode.org/snaptoken/kilo/
  - https://viewsourcecode.org/snaptoken/similarTutorials.html
  - https://antirez.com/news/108
- https://www.fltk.org/doc-1.1/editor.html
- https://prosemirror.net/docs/guide/
- https://marijnhaverbeke.nl/blog/prosemirror.html
- https://aosabook.org/en/v1/eclipse.html
- http://doc.cat-v.org/plan_9/4th_edition/papers/sam/
- http://doc.cat-v.org/plan_9/4th_edition/papers/acme/
- https://ecc-comp.blogspot.com/2015/05/a-brief-glance-at-how-5-text-editors.html
- https://bitbucket.org/danielbarry/saxoperatingsystem/src/master/PROGRAMS/EDIT/EDIT.ASM
- https://raphlinus.github.io/xi/2020/06/27/xi-retrospective.html
- https://code.visualstudio.com/blogs/2018/03/23/text-buffer-reimplementation
- https://texteditors.org/cgi-bin/wiki.pl?DesigningTextEditors
- https://project-mage.org/
- YI is an Emacs-like editor written in Haskell
  https://yi-editor.github.io/
- [[https://publications.lib.chalmers.se/records/fulltext/local_72549.pdf][Yi: An Editor in Haskell for Haskell]]
- "On the design of text editors" ({{{arXiv(2008.06030)}}}).
  
More projects

- https://github.com/practical-tutorials/project-based-learning
- https://github.com/AlgoryL/Projects-from-Scratch
- https://brennan.io/2015/01/16/write-a-shell-in-c/
- https://austinhenley.com/blog/morechallengingprojects.html

If you were rebuilding Emacs from scratch...

- https://www.reddit.com/r/emacs/comments/11nf8ry/rebuilding_emacs_from_scratch_what_would_you_do/
