docs/comp-sci/emacs.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Emacs</title>
<meta name="author" content="Alex Nelson" />
<meta name="generator" content="Org Mode" />
<link rel="preconnect" href="https://fonts.gstatic.com"><link href="https://fonts.googleapis.com/css2?family=Spectral&display=swap" rel="stylesheet">
<link href="https://fonts.googleapis.com/css2?family=Merriweather" rel="stylesheet">
<div style="display: none"> \(
\DeclareMathOperator{\tr}{tr}
\newcommand\D{\mathrm{d}}
\newcommand\E{\mathrm{e}}
\newcommand\I{\mathrm{i}}
\newcommand\bigOh{\mathcal{O}}
\newcommand{\cat}[1]{\mathbf{#1}}
\newcommand\curl{\vec{\nabla}\times}
\newcommand{\CC}{\mathbb{C}}
\newcommand{\NN}{\mathbb{N}}
\newcommand{\QQ}{\mathbb{Q}}
\newcommand{\RR}{\mathbb{R}}
\newcommand{\ZZ}{\mathbb{Z}}
% For +---- metric
\newcommand{\BDpos}{}
\newcommand{\BDneg}{-}
\newcommand{\BDposs}{\phantom{-}}
\newcommand{\BDnegg}{-}
\newcommand{\BDplus}{+}
\newcommand{\BDminus}{-}
% For -+++ metric
\newcommand{\BDpos}{-}
\newcommand{\BDposs}{-}
\newcommand{\BDneg}{}
\newcommand{\BDnegg}{\phantom{-}}
\newcommand{\BDplus}{-}
\newcommand{\BDminus}{+}
\)</div>
<link rel="stylesheet" type="text/css" href="../css/stylesheet.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Emacs</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#h-8891785c-1a46-46ab-8276-4889fce0c0de">1. Building Emacs</a>
<ul>
<li><a href="#h-ba49b372-73c2-4fd0-b06a-82b7e417c232">1.1. On Windows</a></li>
</ul>
</li>
<li><a href="#h-4ca3ccca-26c9-4547-b901-c17e58cd988d">2. Architecture</a>
<ul>
<li><a href="#h-62586872-e676-4902-ae7a-5f2f27ac03d1">2.1. Text Editor Architecture</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-h-8891785c-1a46-46ab-8276-4889fce0c0de" class="outline-2">
<h2 id="h-8891785c-1a46-46ab-8276-4889fce0c0de"><span class="section-number-2">1.</span> Building Emacs</h2>
<div class="outline-text-2" id="text-h-8891785c-1a46-46ab-8276-4889fce0c0de">
<p>
Compiling Emacs from scratch does not seem to be well documented.
</p>
</div>
<div id="outline-container-h-ba49b372-73c2-4fd0-b06a-82b7e417c232" class="outline-3">
<h3 id="h-ba49b372-73c2-4fd0-b06a-82b7e417c232"><span class="section-number-3">1.1.</span> On Windows</h3>
<div class="outline-text-3" id="text-h-ba49b372-73c2-4fd0-b06a-82b7e417c232">
<p>
There are two ways to go about this: either use Mingw, or use the
Windows Subystem for Linux (WSL).
</p>

<p>
MinGW uses Pacman as its package manager, so all you need to do is
something like <code>pacman -S emacs</code>.
</p>

<p>
For WSL, I use Ubuntu WSL. Although I could just use the package
provided, I build it from scratch. My shell looks something like:
</p>

<pre class="example" id="org198381e">
~ $ mkdir -p src/
~ $ cd src
~/src/ $ git clone https://git.savannah.gnu.org/git/emacs.git
~/src/emacs/ $ git checkout emacs-28
~/src/emacs/ $ ./autogen.sh
~/src/emacs/ $ ./configure --with-wide-int --with-gnutls=ifavailable --with-x-toolkit=no --with-m17n-flt --with-modules --with-json --with-threads --with-included-regex --with-compress-install CFLAGS="-O3 -mtune=native -march=native -fno-finite-math-only"
...
~/src/emacs/ $ make
...
~/src/emacs/ $ sudo make install
...
</pre>
</div>
</div>
</div>
<div id="outline-container-h-4ca3ccca-26c9-4547-b901-c17e58cd988d" class="outline-2">
<h2 id="h-4ca3ccca-26c9-4547-b901-c17e58cd988d"><span class="section-number-2">2.</span> Architecture</h2>
<div class="outline-text-2" id="text-h-4ca3ccca-26c9-4547-b901-c17e58cd988d">
<ul class="org-ul">
<li>Richard Stallman's <a href="https://www.gnu.org/software/emacs/emacs-paper.html">1981 Emacs Paper</a></li>
<li><a href="https://chrismennie.ca/EMACS-Conceptual-Architecture.pdf">Conceptual Views of EMACS’s Architecture (PDF)</a></li>
<li><a href="https://www.finseth.com/craft/">Craft of Text Editing</a></li>
<li>Greenberg's <a href="https://multicians.org/mepap.html">Multics Emacs: The History, Design and Implementation</a></li>
<li><a href="https://corwin.bru.st/2024-01-09-emacs-devel-design-and-architecture/">Emacs Devel: Design and Architecture</a></li>
<li><a href="https://lists.gnu.org/archive/html/emacs-devel/2010-07/msg00315.html">https://lists.gnu.org/archive/html/emacs-devel/2010-07/msg00315.html</a></li>
<li><a href="https://github.com/DavidSatimeWallin/openemacs">https://github.com/DavidSatimeWallin/openemacs</a></li>
</ul>
</div>
<div id="outline-container-h-62586872-e676-4902-ae7a-5f2f27ac03d1" class="outline-3">
<h3 id="h-62586872-e676-4902-ae7a-5f2f27ac03d1"><span class="section-number-3">2.1.</span> Text Editor Architecture</h3>
<div class="outline-text-3" id="text-h-62586872-e676-4902-ae7a-5f2f27ac03d1">
<p>
More generally, we could examine the architecture of a "generic" text
editor.
</p>

<ul class="org-ul">
<li>Finseth's dissertation "Theory and practice of text editors, or, A cookbook for an Emacs" <a href="https://dspace.mit.edu/handle/1721.1/15905">https://dspace.mit.edu/handle/1721.1/15905</a></li>
<li><a href="https://viewsourcecode.org/snaptoken/kilo/">https://viewsourcecode.org/snaptoken/kilo/</a>
<ul class="org-ul">
<li><a href="https://viewsourcecode.org/snaptoken/similarTutorials.html">https://viewsourcecode.org/snaptoken/similarTutorials.html</a></li>
<li><a href="https://antirez.com/news/108">https://antirez.com/news/108</a></li>
</ul></li>
<li><a href="https://www.fltk.org/doc-1.1/editor.html">https://www.fltk.org/doc-1.1/editor.html</a></li>
<li><a href="https://prosemirror.net/docs/guide/">https://prosemirror.net/docs/guide/</a></li>
<li><a href="https://marijnhaverbeke.nl/blog/prosemirror.html">https://marijnhaverbeke.nl/blog/prosemirror.html</a></li>
<li><a href="https://aosabook.org/en/v1/eclipse.html">https://aosabook.org/en/v1/eclipse.html</a></li>
<li><a href="http://doc.cat-v.org/plan_9/4th_edition/papers/sam/">http://doc.cat-v.org/plan_9/4th_edition/papers/sam/</a></li>
<li><a href="http://doc.cat-v.org/plan_9/4th_edition/papers/acme/">http://doc.cat-v.org/plan_9/4th_edition/papers/acme/</a></li>
<li><a href="https://ecc-comp.blogspot.com/2015/05/a-brief-glance-at-how-5-text-editors.html">https://ecc-comp.blogspot.com/2015/05/a-brief-glance-at-how-5-text-editors.html</a></li>
<li><a href="https://bitbucket.org/danielbarry/saxoperatingsystem/src/master/PROGRAMS/EDIT/EDIT.ASM">https://bitbucket.org/danielbarry/saxoperatingsystem/src/master/PROGRAMS/EDIT/EDIT.ASM</a></li>
<li><a href="https://raphlinus.github.io/xi/2020/06/27/xi-retrospective.html">https://raphlinus.github.io/xi/2020/06/27/xi-retrospective.html</a></li>
<li><a href="https://code.visualstudio.com/blogs/2018/03/23/text-buffer-reimplementation">https://code.visualstudio.com/blogs/2018/03/23/text-buffer-reimplementation</a></li>
<li><a href="https://texteditors.org/cgi-bin/wiki.pl?DesigningTextEditors">https://texteditors.org/cgi-bin/wiki.pl?DesigningTextEditors</a></li>
<li><a href="https://project-mage.org/">https://project-mage.org/</a></li>
<li>YI is an Emacs-like editor written in Haskell
<a href="https://yi-editor.github.io/">https://yi-editor.github.io/</a></li>
<li><a href="https://publications.lib.chalmers.se/records/fulltext/local_72549.pdf">Yi: An Editor in Haskell for Haskell</a></li>
<li>"On the design of text editors" (<a href="https://arxiv.org/abs/2008.06030">arXiv:2008.06030</a>).</li>
</ul>

<p>
More projects
</p>

<ul class="org-ul">
<li><a href="https://github.com/practical-tutorials/project-based-learning">https://github.com/practical-tutorials/project-based-learning</a></li>
<li><a href="https://github.com/AlgoryL/Projects-from-Scratch">https://github.com/AlgoryL/Projects-from-Scratch</a></li>
<li><a href="https://brennan.io/2015/01/16/write-a-shell-in-c/">https://brennan.io/2015/01/16/write-a-shell-in-c/</a></li>
<li><a href="https://austinhenley.com/blog/morechallengingprojects.html">https://austinhenley.com/blog/morechallengingprojects.html</a></li>
</ul>

<p>
If you were rebuilding Emacs from scratch&#x2026;
</p>

<ul class="org-ul">
<li><a href="https://www.reddit.com/r/emacs/comments/11nf8ry/rebuilding_emacs_from_scratch_what_would_you_do/">https://www.reddit.com/r/emacs/comments/11nf8ry/rebuilding_emacs_from_scratch_what_would_you_do/</a></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="postamble">Last Updated: Sun, 11 May 2025 09:14:21 -0700
</div>
</body>
</html>
